using System;

namespace HW3
{
    class Program
    {
        static void Main(string[] args)
        {
            //----------------------------------------------------------------------------------------------------------------------------------------
            //Написать программу, которая считывает символы с клавиатуры, пока не будет введена точка. 
            //Программа должна сосчитать количество введенных пользователем пробелов.
            //----------------------------------------------------------------------------------------------------------------------------------------

            /*var text = "";
            var spaceCount = 0;
            var isExit = false;
            while (!isExit)
            {
                text += Console.ReadKey().KeyChar;
                if (text[text.Length - 1] == '.')
                    isExit = true;
                else if (text[text.Length - 1] == ' ')
                    spaceCount++;
            }
            Console.WriteLine($"\nКоличество пробелов: {spaceCount}");*/

            //----------------------------------------------------------------------------------------------------------------------------------------
            //Ввести с клавиатуры номер трамвайного билета(6 - значное число) и про-верить является ли данный билет счастливым
            //(если на билете напечатано шестизначное число, и сумма первых трёх цифр равна сумме последних трёх, то этот билет считается счастливым).
            //----------------------------------------------------------------------------------------------------------------------------------------

            /*Console.WriteLine("Введите номер трамвайного билета(6 - значное число)");
            var ticketNumber = Convert.ToInt32(Console.ReadLine());
            var luckyTickedSum = 0;
            while(ticketNumber/100000<1 || ticketNumber/1000000 != 0)
            {
                Console.Write("Неккоректный ввод, попробуйте заново: ");
                ticketNumber = Convert.ToInt32(Console.ReadLine());
            }
            for(int i = 0; i < 6; i++)
            {
                if (i < 3)
                {
                    luckyTickedSum += ticketNumber % 10;
                }
                else
                {
                    luckyTickedSum -= ticketNumber % 10;
                }
                ticketNumber /= 10;
            }
            if(luckyTickedSum == 0)
            {
                Console.WriteLine("Поздравляю, у вас счастливый билет!");
            }
            else
            {
                Console.WriteLine("Поздравляю, у вас не счастливый билет!");
            }*/

            //----------------------------------------------------------------------------------------------------------------------------------------
            //Числовые значения символов нижнего регистра в коде ASCII отличаются от значений символов верхнего регистра на величину 32.
            //Hаписать программу, которая считывает с клавиатуры и конвертирует все символы нижнего регистра в символы верхнего регистра и наоборот
            //----------------------------------------------------------------------------------------------------------------------------------------

            /*var text = Console.ReadLine();
            var tmp = "";
            for(int i = 0; i < text.Length; i++)
            {
                if ((int)text[i] >= 65 && (int)text[i] <= 90)
                {
                    tmp += text[i].ToString().ToLower();
                }
                else if ((int)text[i] >= 97 && (int)text[i] <= 122)
                {
                    tmp += text[i].ToString().ToUpper();
                }
                else
                {
                    tmp += text[i];
                }
            }
            text = tmp;
            Console.WriteLine(text);*/

            //----------------------------------------------------------------------------------------------------------------------------------------
            //Даны целые положительные числа A и B(A < B).Вывести все целые числа от A до B включительно; каждое число должно выводиться на новой строке; 
            //при этом каждое число должно выводиться количество раз, равное его значению. 
            //Например: если А = 3, а В = 7, то программа должна сформировать в консоли следующий вывод:
            //                                               3 3 3
            //                                               4 4 4 4
            //                                               5 5 5 5 5
            //                                               6 6 6 6 6 6
            //                                               7 7 7 7 7 7 7
            //----------------------------------------------------------------------------------------------------------------------------------------

            /*var numberA = Convert.ToInt32(Console.ReadLine());
            var numberB = Convert.ToInt32(Console.ReadLine());
            for(int i = numberA; i <= numberB; i++)
            {
                for(int j = 0; j < i; j++)
                {
                    Console.Write(i+" ");
                }
                Console.WriteLine();
            }*/

            //----------------------------------------------------------------------------------------------------------------------------------------
            //Дано целое число N(> 0), найти число, полученное при прочтении числа N справа налево. 
            //Например, если было введено число 345, то программа должна вывести число 543.
            //----------------------------------------------------------------------------------------------------------------------------------------

            var number = Convert.ToInt32(Console.ReadLine());
            int result = 0;
            while (number > 0)
            {
                result *= 10;
                result += number % 10;
                number /= 10;
            }
            Console.WriteLine(result);


            Console.ReadKey();
        }
    }
}
